АлогистикТест2/src/Documents/алк_ЗагрузкаКонтейнера/алк_ЗагрузкаКонтейнера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗагрузкаКонтейнера</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКонтейнера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентифицирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыНоменклатуры</name>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ЗагрузкаКонтейнера/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ИспользоватьАддендумы", ТипЗнч(Заказ) = Тип("ДокументСсылка.алк_Аддендумы"));
		
	//Установить индентификаторы товара из заказа
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И ДополнительныеСвойства.ИспользоватьАддендумы = Истина тогда
		Документы.алк_ЗагрузкаКонтейнера.УстановитьИдентификаторыТоваровАддендумов(ЭтотОбъект, Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";	
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры               


Процедура ПриКопировании(ОбъектКопирования)
	Запасы.Очистить();
	Ответственный = Пользователи.ТекущийПользователь();
	ОбъемДокумента = 0;
	КоличествоДокумента = 0;
	ПараметрыСмены = алк_ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыСменыПоДате(ТекущаяДата());
	ДатаСмены = ПараметрыСмены.ДатаСмены;
	СменаУдалить = ПараметрыСмены.Смена;
КонецПроцедуры


//02.02.2023 Дубоделов Э.А Выдавал ошибку при создании с установленным отбором
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	ПроверитьДанныеСтруктуры(ДанныеЗаполнения);
	
	Для Каждого Элемент Из ДанныеЗаполнения Цикл
		ЭтотОбъект[Элемент.Ключ] = Элемент.Значение;	
	КонецЦикла;
	
КонецПроцедуры


Процедура ПроверитьДанныеСтруктуры(ДанныеЗаполнения)
	 
	Если ДанныеЗаполнения.Свойство("Номер") Тогда
		ДанныеЗаполнения.Удалить("Номер")
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Дата") Тогда
		ДанныеЗаполнения.Удалить("Дата")
	КонецЕсли;	
	
	Если ДанныеЗаполнения.Свойство("ДатаСмены") Тогда
		ДанныеЗаполнения.Удалить("ДатаСмены")
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ПометкаУдаления") Тогда
		ДанныеЗаполнения.Удалить("ПометкаУдаления")
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Проведен") Тогда
		ДанныеЗаполнения.Удалить("Проведен")
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Ссылка") Тогда
		ДанныеЗаполнения.Удалить("Ссылка")
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Ответственный") Тогда
		ДанныеЗаполнения.Удалить("Ответственный")
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
	КонецЕсли;
		
КонецПроцедуры
//02.02.2023 Дубоделов Э.А
